Revit 2024 API
ReinforcementSettings.GetReinforcementSettings Method
 Obtains the ReinforcementSettings object for the specified project document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static ReinforcementSettings GetReinforcementSettings(
	Document document
)
Visual Basic
Public Shared Function GetReinforcementSettings ( _
	document As Document _
) As ReinforcementSettings
Visual C++
public:
static ReinforcementSettings^ GetReinforcementSettings(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 A project document.
Return Value
 The ReinforcementSettings object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a project document.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace